system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// application     pimpleAcoFoam;
//application     pimpleFoam;
application     simpleFoam;

startFrom       latestTime;

startTime	    0;

stopAt          endTime;
//stopAt          nextWrite;
//stopAt          writeNow;

endTime         6000;

deltaT          1;

avgTime           1e-10;
acoStartTime      5e-4;
deltaAcoTime       1e-6;
acoTimeToFlowTime  0.1;
acoAdjustTimeStep  yes;

//writeControl    timeStep;adjustableRunTime
writeControl    timeStep;

adjustTimeStep no;

// maxCo       1.2;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;


// ************************************************************************* //
