constant/polyMesh/boundary
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}

6         
(
    INLET
    {
        type patch;
        nFaces 297;
        startFace 323179;
    }
    OUTLET
    {
        type patch;
        nFaces 297;
        startFace 323476;
    }
    WALL_CYLINDER
    {
        type wall;
        nFaces 396;
        startFace 323773;
    }
    WALL_DOWN
    {
        type symmetry;
        nFaces 452;
        startFace 324169;
    }
    WALL_UP
    {
        type symmetry;
        nFaces 452;
        startFace 324621;
    }
    BaseAndTop
    {
        type empty;
        nFaces 324126;
        startFace 325073;
    }
)
