0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        //type            inletOutlet;
        //inletValue      uniform 0;
        //value           uniform 0;
        type              freestreamPressure;
        freestreamValue   uniform 0;
    }

    OUTLET
    {
        //type            fixedValue;
        //type            inletOutlet;
        //inletValue      uniform 0;
        //value           uniform 0;
        type              freestreamPressure;
        freestreamValue   uniform 0;
    }

    WALL_DOWN
    {
       type            symmetry;

        //type            zeroGradient;
    }

    WALL_UP
    {
        type            symmetry;
        //type            zeroGradient;
    }

    WALL_CYLINDER
    {
        type            zeroGradient;
    }

    BaseAndTop
    {
        type            empty;
    }
}

// ************************************************************************* //
